src/fixtures/fixVerifyResponse.ts

/*export const paVerify17 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>120.00</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>true</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify18 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>120.00</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>false</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify19 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>120.00</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>false</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify20 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
            <paymentOptionDescription>
                <amount>120.00</amount>
                <options>EQ</options>
                <dueDate>2030-07-31</dueDate>
                <detailDescription>pagamentoTest</detailDescription>
                <allCCP>false</allCCP>
            </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify21 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
            <paymentOptionDescription>
                <amount>120.00</amount>
                <options>EQ</options>
                <dueDate>2030-07-31</dueDate>
                <detailDescription>pagamentoTest</detailDescription>
                <allCCP>false</allCCP>
            </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify22 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
            <paymentOptionDescription>
                <amount>120.00</amount>
                <options>EQ</options>
                <dueDate>2030-07-31</dueDate>
                <detailDescription>pagamentoTest</detailDescription>
                <allCCP>true</allCCP>
            </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify23 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
            <paymentOptionDescription>
                <amount>120.00</amount>
                <options>EQ</options>
                <dueDate>2030-07-31</dueDate>
                <detailDescription>pagamentoTest</detailDescription>
                <allCCP>true</allCCP>
            </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>Veeery long company PA name which fills all available 140 characters, (are you still reading? You should not stare at a screen for too long)</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify24 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>120.00</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31+02:00</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>true</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify25 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>999000000.99</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31+02:00</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>true</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerify26 = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>3000.00</amount>
                    <options>EQ</options>
                    <dueDate>2030-07-31+02:00</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>true</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>companyName</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;

export const paVerifyPagamentoDuplicato = `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>KO</outcome>
            <fault>
                <faultCode>PAA_PAGAMENTO_DUPLICATO</faultCode>
                <faultString>Errore mockato - caso PAA_PAGAMENTO_DUPLICATO</faultString>
                <id>77777777777</id>
            </fault>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`;
*/

interface PaVerifyOptions {
  allCCP?: boolean;
  amount?: string;
  dueDate?: string;
  companyName?: string;
}

interface PaVerifyResult {
  xml: string;
  options: Required<PaVerifyOptions>;
}

const buildPaVerify = (opts: PaVerifyOptions = {}): PaVerifyResult => {
  const options: Required<PaVerifyOptions> = {
    allCCP: opts.allCCP ?? true,
    amount: opts.amount ?? '120.00',
    dueDate: opts.dueDate ?? '2030-07-31',
    companyName: opts.companyName ?? 'companyName',
  };

  return {
    options,
    xml: `<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
    xmlns:paf="http://pagopa-api.pagopa.gov.it/pa/paForNode.xsd">
    <soapenv:Header />
    <soapenv:Body>
        <paf:paVerifyPaymentNoticeRes>
            <outcome>OK</outcome>
            <paymentList>
                <paymentOptionDescription>
                    <amount>${options.amount}</amount>
                    <options>EQ</options>
                    <dueDate>${options.dueDate}</dueDate>
                    <detailDescription>pagamentoTest</detailDescription>
                    <allCCP>${options.allCCP}</allCCP>
                </paymentOptionDescription>
            </paymentList>
            <paymentDescription>Pagamento di Test</paymentDescription>
            <fiscalCodePA>77777777777</fiscalCodePA>
            <companyName>${options.companyName}</companyName>
            <officeName>officeName</officeName>
        </paf:paVerifyPaymentNoticeRes>
    </soapenv:Body>
</soapenv:Envelope>`,
  };
};

const LONG_COMPANY_NAME = 'Veeery long company PA name which fills all available 140 characters, (are you still reading? You should not stare at a screen for too long)';
export const paVerify00 = buildPaVerify({ allCCP: true });
export const paVerify01 = buildPaVerify({ allCCP: true });
export const paVerify02 = buildPaVerify({ allCCP: true });
export const paVerify03 = buildPaVerify({ allCCP: true });
export const paVerify04 = buildPaVerify({ allCCP: true, amount:'100.00' });
export const paVerify05 = buildPaVerify({ allCCP: true, amount:'100.00'});
export const paVerify06 = buildPaVerify({ allCCP: true, amount:'100.00'});
export const paVerify07 = buildPaVerify({ allCCP: true, amount:'100.00' });
export const paVerify08 = buildPaVerify({ allCCP: true, amount:'100.00' });
export const paVerify09 = buildPaVerify({ allCCP: true, amount:'100.00' });
export const paVerify10 = buildPaVerify({ allCCP: true, amount:'70.00' });
export const paVerify11 = buildPaVerify({ allCCP: true, amount:'70.00' });
export const paVerify12 = buildPaVerify({ allCCP: true, amount:'6000.00' });
export const paVerify13 = buildPaVerify({ allCCP: true, amount:'0.30'});
export const paVerify14 = buildPaVerify({ allCCP: true });
export const paVerify15 = buildPaVerify({ allCCP: true });
export const paVerify16 = buildPaVerify({ allCCP: true });
export const paVerify17 = buildPaVerify({ allCCP: true });
export const paVerify18 = buildPaVerify({ allCCP: false });
export const paVerify19 = buildPaVerify({ allCCP: false });
export const paVerify20 = buildPaVerify({ allCCP: false });
export const paVerify21 = buildPaVerify({ allCCP: false });
export const paVerify22 = buildPaVerify({ allCCP: true });
export const paVerify23 = buildPaVerify({ allCCP: true, companyName: LONG_COMPANY_NAME });
export const paVerify24 = buildPaVerify({ allCCP: true, dueDate: '2030-07-31+02:00' });
export const paVerify25 = buildPaVerify({ allCCP: true, dueDate: '2030-07-31+02:00', amount: '999999999.99' });
export const paVerify26 = buildPaVerify({ allCCP: true, dueDate: '2030-07-31+02:00', amount: '3000.00' });


export const paVerifyPagamentoDuplicato = buildPaVerify({ allCCP: true, dueDate: '2030-07-31+02:00', amount: '3000.00' });;